-- 1. Создание таблицы (Домохозяйства и население)
CREATE TABLE information_society_2_5 (
    "Год" INT PRIMARY KEY,
    "Доля_домохоз_с_тел" NUMERIC(5,2),
    "Только_фикс_тел" NUMERIC(5,2),
    "Только_моб_тел" NUMERIC(5,2),
    "Оба_вида_тел" NUMERIC(5,2),
    "Доля_домохоз_с_ПК" NUMERIC(5,2),
    "ПК_на_100_домохоз" INT,
    "Моб_на_100_домохоз" INT,
    "Польз_моб_население" NUMERIC(5,2),
    "Интернет_через_ПК_домохоз" NUMERIC(5,2),
    "Доступ_в_инет_домохоз" NUMERIC(5,2),
    "Польз_инет_на_100_чел" INT,
    "Активные_польз_инет" NUMERIC(5,2),
    "Общая_доля_польз_инет" NUMERIC(5,2),
    "Госуслуги_инет_доля_нас" NUMERIC(5,2),
    "Госуслуги_инет_от_всех_услуг" NUMERIC(5,2),
    "ШПД_домохоз" NUMERIC(5,2),
    "Покупки_онлайн_население" NUMERIC(5,2)
);

-- 2. Вставка данных
INSERT INTO information_society_2_5 VALUES
(2010, 97.9, 4.7, 27.6, 65.6, 54.5, 63, 228, NULL, 41.3, 48.4, NULL, NULL, 38.0, NULL, NULL, NULL, NULL),
(2011, 98.3, 3.6, 29.1, 65.6, 60.1, 75, 237, NULL, 50.2, 56.8, NULL, NULL, 46.9, NULL, NULL, NULL, NULL),
(2012, 98.7, 2.7, 33.5, 62.5, 66.5, 86, 244, NULL, 59.1, 63.8, NULL, NULL, 54.4, NULL, NULL, NULL, NULL),
(2013, 99.1, 2.0, 36.0, 61.2, 71.4, 100, 250, NULL, 65.1, 69.1, 64, 61.4, 60.7, 10.7, 30.8, 56.5, 15.3),
(2014, 99.1, 1.5, 40.5, 57.1, 71.0, 113, 257, NULL, 67.0, 69.9, 67, 64.9, 67.2, 10.6, 35.2, 64.1, 17.8),
(2015, 99.6, 0.6, 65.8, 33.6, 72.5, 125, 256, NULL, 68.4, 72.1, 70, 68.3, 70.1, 18.4, 39.6, 66.8, 19.6),
(2016, 99.8, 0.7, 50.9, 48.4, 74.3, 127, 245, NULL, 70.3, 74.8, 73, 71.5, 73.1, 28.8, 51.3, 70.7, 23.1),
(2017, 99.8, 0.5, 55.1, 44.3, 74.4, 124, 245, NULL, 70.3, 76.3, 76, 74.1, 76.0, 42.3, 64.3, 72.6, 29.1),
(2018, 99.9, 0.5, 58.2, 41.2, 72.4, 125, 247, 94.8, 69.0, 76.6, 81, 79.3, 80.9, 54.5, 74.8, 73.2, 34.7),
(2019, 99.9, 0.4, 62.7, 36.9, 69.4, 126, 250, 97.0, 65.4, 76.9, 83, 81.4, 82.6, 56.5, 77.6, 73.6, 35.7),
(2020, 99.9, 0.3, 66.1, 33.5, 72.1, 128, 251, 97.3, 65.9, 80.0, 85, 84.1, 85.0, 58.7, 81.1, 77.0, 40.3),
(2021, 99.9, 0.3, 70.3, 29.4, 72.6, 126, 251, 98.1, 65.1, 84.0, 88, 87.3, 88.2, 68.2, 85.1, 82.6, 46.6),
(2022, 99.9, 0.2, 74.2, 25.5, 73.0, 129, 248, 98.8, 65.5, 86.6, 90, 89.8, 90.4, 71.0, 86.6, 85.5, 53.7),
(2023, 99.9, 0.2, 77.8, 21.9, 71.2, 130, 249, 98.6, 64.6, 87.9, 92, 91.5, 92.2, 74.6, 87.9, 87.3, 61.3),
(2024, NULL, NULL, NULL, NULL, 72.2, NULL, NULL, 98.8, 64.6, 90.4, 94, 93.7, 94.4, 77.3, 89.6, 89.8, 71.6),
(2025, NULL, NULL, NULL, NULL, 71.9, NULL, NULL, 99.0, 65.1, 91.9, 96, 95.0, 95.6, 80.6, 92.5, 91.4, 75.6);