-- Создание таблицы
CREATE TABLE education_2_13 (
    id SERIAL PRIMARY KEY,
    year INTEGER NOT NULL,
    age_group VARCHAR(20) NOT NULL,
    total INTEGER NOT NULL,
    women INTEGER NOT NULL
);

-- Вставка данных за 2023 год
INSERT INTO education_2_13 (year, age_group, total, women) VALUES
(2023, 'до 22 (включительно)', 495, 68),
(2023, '23', 4236, 769),
(2023, '24', 14265, 2691),
(2023, '25', 16844, 4114),
(2023, '26', 16058, 4675),
(2023, '27', 12551, 4263),
(2023, '28', 8115, 3093),
(2023, '29', 5365, 2184),
(2023, '30-34', 16135, 5656),
(2023, '35-39', 13029, 3709),
(2023, '40 и старше', 14462, 4598);

-- Вставка данных за 2024 год
INSERT INTO education_2_13 (year, age_group, total, women) VALUES
(2024, 'до 22 (включительно)', 354, 72),
(2024, '23', 4245, 725),
(2024, '24', 16397, 3073),
(2024, '25', 17882, 3770),
(2024, '26', 17555, 4489),
(2024, '27', 14154, 3956),
(2024, '28', 8241, 2904),
(2024, '29', 5547, 2086),
(2024, '30-34', 15011, 5382),
(2024, '35-39', 12307, 3429),
(2024, '40 и старше', 14254, 4533);