-- Создание таблицы
CREATE TABLE information_society_1_3 (
    год INT PRIMARY KEY,
    телефонная_плотность_фикс_связи DECIMAL(10,2),
    проникновение_сотовой_связи DECIMAL(10,2),
    доля_населения_аналоговое_тв DECIMAL(5,2),
    доля_населения_цифровое_тв DECIMAL(5,2),
    доля_населения_кабельное_тв DECIMAL(5,2),
    абоненты_фикс_шпд DECIMAL(10,2),
    абоненты_моб_шпд DECIMAL(10,2),
    цифровизация_местной_сети_всего DECIMAL(5,2),
    цифровизация_местной_сети_город DECIMAL(5,2),
    цифровизация_местной_сети_село DECIMAL(5,2),
    телефонизированные_пункты_село DECIMAL(5,2),
    объем_услуг_почтовой_связи DECIMAL(10,2),
    трафик_фикс_сети_пб DECIMAL(12,2),
    трафик_моб_сети_пб DECIMAL(12,2),
    тариф_абонентской_линии DECIMAL(10,2),
    абонентская_плата_интернет DECIMAL(10,2),
    тариф_моб_связь_минута DECIMAL(10,2),
    абонентская_плата_моб_пакет DECIMAL(10,2),
    тариф_фикс_связь_минута DECIMAL(10,2),
    плата_за_доступ_юрлица DECIMAL(10,2),
    абонентская_плата_юрлица DECIMAL(10,2)
);

-- Вставка данных (2010 - 2024 гг.)
INSERT INTO information_society_1_3 (
    год, телефонная_плотность_фикс_связи, проникновение_сотовой_связи, доля_населения_аналоговое_тв, 
    доля_населения_цифровое_тв, доля_населения_кабельное_тв, абоненты_фикс_шпд, абоненты_моб_шпд, 
    цифровизация_местной_сети_всего, цифровизация_местной_сети_город, цифровизация_местной_сети_село, 
    телефонизированные_пункты_село, объем_услуг_почтовой_связи, трафик_фикс_сети_пб, трафик_моб_сети_пб, 
    тариф_абонентской_линии, абонентская_плата_интернет, тариф_моб_связь_минута, абонентская_плата_моб_пакет, 
    тариф_фикс_связь_минута, плата_за_доступ_юрлица, абонентская_плата_юрлица
) VALUES
(2010, 31.4, 166.4, 98.6, 6.0, 12.4, NULL, NULL, 81.0, 83.0, 63.9, 90.1, 670.5, NULL, NULL, 150.78, 599.37, 2.25, NULL, 0.32, 5719.27, 516.24),
(2011, 30.8, 178.4, 98.7, 18.3, 12.5, 12.2, 47.8, 85.3, 87.6, 65.9, 90.1, 774.7, 8274.0, 218.2, 165.28, 555.57, 1.60, NULL, 0.37, 5382.42, 549.16),
(2012, 30.1, 182.4, 98.9, 30.8, 18.3, 14.4, 52.5, 86.4, 88.5, 67.3, 90.0, 839.5, 9923.7, 471.1, 176.15, 537.10, 1.42, NULL, 0.40, 4759.66, 572.76),
(2013, 28.8, 192.8, 97.9, 44.0, 35.8, 16.5, 59.62, 87.9, 89.7, 72.5, 89.0, 873.2, 13414.2, 849.7, 186.25, 538.67, 1.27, NULL, 0.44, 3894.04, 597.25),
(2014, 26.7, 187.2, 97.2, 61.5, 38.3, 16.9, 63.2, 88.7, 90.2, 74.8, 89.1, 863.8, 17012.9, 1452.7, 187.98, 565.44, 1.16, NULL, 0.46, 3661.77, 607.78),
(2015, 24.7, 192.9, 97.6, 71.0, 36.5, 18.1, 67.8, 89.6, 91.0, 77.8, 88.7, 916.2, 22967.8, 2241.0, 187.41, 571.11, 1.12, NULL, 0.50, 3628.50, 623.94),
(2016, 23.2, 196.8, 97.6, 88.5, 33.7, 18.5, 70.7, 91.0, 92.0, 81.3, 88.2, 993.2, 27609.7, 3356.9, 190.63, 559.44, 1.17, NULL, 0.54, 3651.85, 636.69),
(2017, 22.1, 199.0, 97.8, 97.4, 43.2, 20.9, 79.4, 92.6, 93.5, 83.1, 88.1, 1073.4, 33956.4, 6160.7, 190.48, 571.48, 1.39, NULL, 0.57, 3624.33, 641.91),
(2018, 20.6, 195.5, 97.7, 98.6, 34.7, 21.5, 85.6, 93.3, 94.1, 84.9, 88.0, 1132.9, 36359.1, 9685.9, 190.55, 563.68, 1.58, 270.19, 0.58, 3596.73, 640.75),
(2019, 18.9, 209.3, 61.3, 98.6, 35.9, 22.0, 95.6, 94.4, 95.0, 87.4, 87.9, 1230.8, 43751.4, 14633.2, 196.83, 554.08, 1.98, 345.58, 0.60, 3007.36, 654.66),
(2020, 17.7, 206.3, 54.9, 98.6, 37.0, 22.8, 98.8, 95.0, 95.6, 89.3, 91.9, 1279.1, 59161.3, 21524.6, 197.17, 552.88, NULL, 388.86, 0.59, 2978.05, 658.04),
(2021, 16.4, 218.8, 44.0, 98.6, 38.9, 23.4, 106.5, 96.0, 96.5, 90.8, 77.7, 1321.3, 74480.7, 28238.5, 199.81, 571.41, NULL, 405.22, 0.60, 2963.46, 666.17),
(2022, 15.2, 215.2, 49.5, 98.6, 37.3, 24.3, 109.2, 96.8, 97.2, 92.7, 69.8, 1199.3, 87081.7, 33768.1, 211.47, 585.02, NULL, 478.23, 0.63, 3186.56, 712.02),
(2023, 14.3, 218.8, 47.9, 98.7, 38.2, 25.1, 115.9, 97.7, 97.9, 94.6, 66.0, 1197.8, 111210.5, 39403.1, 216.18, 608.17, NULL, 543.51, 0.65, 2678.63, 646.23),
(2024, 13.3, 228.3, 45.6, 98.7, NULL, 26.1, 123.5, 98.2, 98.4, 95.7, 64.3, 1244.2, 141780.1, 44613.4, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(2025, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);